
a5-a7.o:     ファイル形式 elf32-s390


セクション .text の逆アセンブル:

00000000 <.text>:
   0:	a5 10 34 56       	iihh	%r1,13398
   4:	a5 11 34 56       	iihl	%r1,13398
   8:	a5 12 34 56       	iilh	%r1,13398
   c:	a5 13 34 56       	iill	%r1,13398
  10:	a5 14 34 56       	nihh	%r1,13398
  14:	a5 15 34 56       	nihl	%r1,13398
  18:	a5 16 34 56       	nilh	%r1,13398
  1c:	a5 17 34 56       	nill	%r1,13398
  20:	a5 18 34 56       	oihh	%r1,13398
  24:	a5 19 34 56       	oihl	%r1,13398
  28:	a5 1a 34 56       	oilh	%r1,13398
  2c:	a5 1b 34 56       	oill	%r1,13398
  30:	a5 1c 34 56       	llihh	%r1,13398
  34:	a5 1d 34 56       	llihl	%r1,13398
  38:	a5 1e 34 56       	llilh	%r1,13398
  3c:	a5 1f 34 56       	llill	%r1,13398
  40:	a7 10 34 56       	tmlh	%r1,13398
  44:	a7 11 34 56       	tmll	%r1,13398
  48:	a7 12 34 56       	tmhh	%r1,13398
  4c:	a7 13 34 56       	tmhl	%r1,13398
  50:	a7 14 34 56       	jo	0x68fc
  54:	a7 15 34 56       	bras	%r1,0x6900
  58:	a7 16 34 56       	brct	%r1,0x6904
  5c:	a7 17 34 56       	brctg	%r1,0x6908
  60:	a7 18 34 56       	lhi	%r1,13398
  64:	a7 19 34 56       	lghi	%r1,13398
  68:	a7 1a 34 56       	ahi	%r1,13398
  6c:	a7 1b 34 56       	aghi	%r1,13398
  70:	a7 1c 34 56       	mhi	%r1,13398
  74:	a7 1d 34 56       	mghi	%r1,13398
  78:	a7 1e 34 56       	chi	%r1,13398
  7c:	a7 1f 34 56       	cghi	%r1,13398
