
a5.o:     ファイル形式 elf32-s390


セクション .text の逆アセンブル:

00000000 <.text>:
   0:	a5 10 34 56       	iihh	%r1,13398
   4:	a5 11 34 56       	iihl	%r1,13398
   8:	a5 12 34 56       	iilh	%r1,13398
   c:	a5 13 34 56       	iill	%r1,13398
  10:	a5 14 34 56       	nihh	%r1,13398
  14:	a5 15 34 56       	nihl	%r1,13398
  18:	a5 16 34 56       	nilh	%r1,13398
  1c:	a5 17 34 56       	nill	%r1,13398
  20:	a5 18 34 56       	oihh	%r1,13398
  24:	a5 19 34 56       	oihl	%r1,13398
  28:	a5 1a 34 56       	oilh	%r1,13398
  2c:	a5 1b 34 56       	oill	%r1,13398
  30:	a5 1c 34 56       	llihh	%r1,13398
  34:	a5 1d 34 56       	llihl	%r1,13398
  38:	a5 1e 34 56       	llilh	%r1,13398
  3c:	a5 1f 34 56       	llill	%r1,13398
